app/views/clinics/show.html.erb

SELECT "patients".* FROM "patients"  WHERE "patients"."clinic_id" = $1  [["clinic_id", 2]]
---
<table class="table">
<% @clinic.patients.each do |patient| %>