app/views/quizzes/_questions.html.erb

SELECT  1 AS one FROM "questions"  WHERE "questions"."quiz_id" = $1 LIMIT 1  [["quiz_id", 1]]
SELECT "questions".* FROM "questions"  WHERE "questions"."quiz_id" = $1  [["quiz_id", 3]]
---
<% if !@quiz.questions.empty? %>