app/controllers/api/answers_controller.rb

INSERT INTO "answers" ("body", "correct", "created_at", "question_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Body of an api answer post"], ["correct", "f"], ["created_at", "2015-03-20 05:22:26.886195"], ["question_id", 2], ["updated_at", "2015-03-20 05:22:26.886195"]]
---
  def create
    @answer = Answer.new(answer_params)
    if @answer.save

UPDATE "answers" SET "body" = $1, "updated_at" = $2 WHERE "answers"."id" = 6  [["body", "Body of an api answer post after PUT"], ["updated_at", "2015-03-21 06:16:47.809512"]]
---
  def update
    @answer.update(answer_params)