app/controllers/api/questions_controller.rb

INSERT INTO "questions" ("body", "created_at", "question_type", "quiz_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "What is first step in treating a gaping wound?"], ["created_at", "2015-03-22 20:25:09.573624"], ["question_type", "radio"], ["quiz_id", 1], ["updated_at", "2015-03-22 20:25:09.573624"]]
---
  def create
    @quiz = Quiz.find(params[:question][:quiz_id])
    @question = @quiz.questions.new(question_params)
    @question.save