app/controllers/api/quizzes_controller.rb

  def create
    @user = current_user
    @quiz = current_user.quizzes.new(quiz_params)
    if @quiz.save
---
INSERT INTO "quizzes" ("created_at", "description", "title", "updated_at", "user_id", "viewable_time") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"