app/views/patients/_item.html.erb

SELECT  1 AS one FROM "items"  WHERE "items"."patient_id" = $1 LIMIT 1  [["patient_id", 4]]
SELECT "items".* FROM "items"  WHERE "items"."patient_id" = $1  [["patient_id", 2]]
---
<% if !@patient.items.empty? %>