app/controllers/clinics_controller.rb

SELECT "clinics".* FROM "clinics"
---
  def index
    @clinics = Clinic.all

INSERT INTO "clinics" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-02-27 21:53:22.564634"], ["name", "Cardiology"], ["updated_at", "2015-02-27 21:53:22.564634"]]
---
  def create
    if @clinic.save!

UPDATE "clinics" SET "name" = $1, "updated_at" = $2 WHERE "clinics"."id" = 2  [["name", "ElectroCardiology"], ["updated_at", "2015-02-27 21:58:11.133296"]]
---
  def update
    if @clinic.update(clinic_params)

DELETE FROM "clinics" WHERE "clinics"."id" = $1  [["id", 4]]
---
  def destroy
    @clinic.destroy

SELECT  "clinics".* FROM "clinics"  WHERE "clinics"."id" = $1 LIMIT 1  [["id", 4]]
---
    def set_clinic
      @clinic = Clinic.find(params[:id])