app/controllers/items_controller.rb

  def create
    @patient = Patient.find(params[:item][:patient_id])
    @item = @patient.items.new(item_params)

    if @item.save!
---
SELECT  "patients".* FROM "patients"  WHERE "patients"."id" = $1 LIMIT 1  [["id", 6]]
INSERT INTO "items" ("comment", "name", "patient_id", "value") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "asdasd"], ["name", "sdasd"], ["patient_id", 6], ["value", "asdasd"]]

  def update
    if @item.update(item_params)
---
UPDATE "items" SET "comment" = $1 WHERE "items"."id" = 3  [["comment", "Wow!!!!"]]

  def new
    @patient = Patient.find(params[:patient_id])
---
SELECT  "patients".* FROM "patients"  WHERE "patients"."id" = $1 LIMIT 1  [["id", 6]]

  def edit
    @patient = Patient.find(params[:patient_id])
---
SELECT  "patients".* FROM "patients"  WHERE "patients"."id" = $1 LIMIT 1  [["id", 2]]