app/controllers/patients_controller.rb

  def new
    @patient = Patient.new
    @clinic = Clinic.find(params[:clinic_id])
---
SELECT  "clinics".* FROM "clinics"  WHERE "clinics"."id" = $1 LIMIT 1  [["id", 2]]

  def create
    @clinic = Clinic.find(params[:clinic_id])
    @patient = @clinic.patients.new(patient_params)
    if @patient.save
---
SELECT  "clinics".* FROM "clinics"  WHERE "clinics"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "patients" ("clinic_id", "created_at", "name", "summary", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["clinic_id", 2], ["created_at", "2015-03-05 01:26:03.386722"], ["name", "Jimbo"], ["summary", "sdfasdfa"], ["updated_at", "2015-03-05 01:26:03.386722"]]

  def update
    if @patient.update(patient_params)
---
UPDATE "patients" SET "summary" = $1, "updated_at" = $2 WHERE "patients"."id" = 2  [["summary", "Mary was admitted for manic behavior.  Her episode is really wild."], ["updated_at", "2015-03-12 02:18:04.214959"]]