app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)
    @question.save
---
INSERT INTO "questions" ("body", "created_at", "question_type", "quiz_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "How to you season your potatoes?"], ["created_at", "2015-03-14 21:35:58.454670"], ["question_type", "checkbox"], ["quiz_id", 3], ["updated_at", "2015-03-14 21:35:58.454670"]]

  def update
    @question.update(question_params)
---
UPDATE "questions" SET "question_type" = $1, "updated_at" = $2 WHERE "questions"."id" = 5  [["question_type", "checkbox"], ["updated_at", "2015-03-14 22:04:21.300866"]]